Repository: johan--/workshop-build
Catalog: docs/i18n/*/LC_MESSAGES/chapters/installation.po
Languages: fr

source: Installation and Requirements
fr: Installation et configuration

source: For this workshop you need:
fr: Pour cet atelier vous avez besoin de:

source: Preferable a Linux operating system like Ubuntu
fr: Utilisez de préférence un système Linux comme Ubuntu

source: An editor like Gedit or Mousepad
fr: Un éditeur comme Gedit ou Mousepad

source: `Geoserver <http://geoserver.org>`_ for the routing application
fr: `Geoserver <http://geoserver.org>`_ pour l'application de routage

source: Internet connection
fr: Connexion internet

source: All required tools are available on the `OSGeo LiveDVD <http://live.osgeo.org>`_, so the following reference is a quick summary of how to install it on your own computer running Ubuntu 12.04 or later.
fr: Tous les outils nécessaires sont disponibles sur `OSGeo LiveDVD <http://live.osgeo.org>`_, c'est pourquoi le guide suivant n'est qu'un résumé d'une installation sur un ordinateur utilisant Ubuntu 12.04 ou plus.

source: pgRouting on Ubuntu can be done using packages from a `Launchpad repository <https://launchpad.net/~georepublic/+archive/pgrouting-unstable>`_:
fr: pqRouting peut être utilisé sur Ubuntu en utilisant les paquets du `dépôt Launchpad <https://launchpad.net/~georepublic/+archive/pgrouting-unstable>`_:

source: All you need to do is to open a terminal window and run:
fr: Vous avez juste besoin d'ouvrir un terminal et de lancer:

source: This will also install all required packages such as PostgreSQL and PostGIS if not installed yet.
fr: Ceci va également installer tous les paquets nécessaires comme PostgreSQL et PostGIS s'ils ne sont pas encore installés.

source: Once pgRouting 2.0 has been released it will be available in the ``stable`` repository on Launchpad.
fr: Une fois que pgRouting 2.0 sera publié, il sera disponible dans les dépôts ``stable`` de Launchpad

source: To be up-to-date with changes and improvements you might run ``sudo apt-get update & sudo apt-get upgrade`` from time to time, especially if you use an older version of the LiveDVD.
fr: Pour avoir un système à jour, vous devriez exécuter de temps en temps ``sudo apt-get update & sudo apt-get upgrade``, particulièrement si vous utilisez une ancienne version du LiveDVD

source: To avoid permission denied errors for local users you can set connection method to ``trust`` in ``/etc/postgresql/9.1/main/pg_hba.conf`` and restart PostgreSQL server with ``sudo service postgresql restart``.
fr: Afin d'éviter les erreurs pour les utilisateurs locaux, vous pouvez régler la méthode de connexion à ``trust`` dans ``/etc/postgresql/9.1/main/pg_hba.conf`` et relancer le serveur PostgreSQL avec ``sudo service postgresql restart``.

source: ``pg_hba.conf`` can be only edited with "superuser" rights, ie. from the terminal window with
fr: ``pg_hba.conf`` peut seulement être éditer avec les droits "root" depuis un terminal avec

source: To close the editor again hit ``CTRL-X``.
fr: Pour fermer de nouveau l'éditeur, appuyez sur ``CTRL-X``.

source: Workshop
fr: Atelier

source: When you installed the workshop package you will find all documents in ``/usr/share/pgrouting/workshop/``.
fr: Une fois le paquet de l'atelier installé, vous trouverez tous les documents dans ``/usr/share/pgrouting/workshop/``.

source: We recommend to copy the files to your home directory and make a symbolic link to your webserver's root folder:
fr: Nous vous recommandons de copier les fichiers dans votre répertoire personnel et de créer un lien symbolique vers le répertoire du serveur web root:

source: You can then find all workshop files in the ``pgrouting-workshop`` folder and access to
fr: Vous pouvez trouver tous les fichiers de l'atelier dans le répertoire ``pgrouting-workshop`` et y accèder par

source: Web directory: http://localhost/pgrouting-workshop/web/
fr: Répertoire web: http://localhost/pgrouting-workshop/web/

source: Online manual: http://localhost/pgrouting-workshop/docs/html/
fr: Manuel en ligne: http://localhost/pgrouting-workshop/docs/html/

source: Additional sample data is available in the workshop ``data`` directory. To extract the file run ``tar -xzf ~/Desktop/pgrouting-workshop/data.tar.gz``.
fr: Des exemples de données additionnels sont disponibles dans le répertoire ``data`` de l'atelier. Pour extraire les fichier, exécuter la commande ``tar -xzf ~/Desktop/pgrouting-workshop/data.tar.gz``.

source: Add pgRouting Functions to database
fr: Ajouter les fonctions pgRouting à la base de données

source: Since **version 2.0** pgRouting functions can be easily installed as extension. This requires:
fr: Depuis la **version 2.0**, les fonctions de pgRouting peuvent être facilement installées. Ceci nécessite:

source: PostgreSQL 9.1 or higher
fr: PostgreSQL 9.1 ou supérieur

source: PostGIS 2.x installed as extension
fr: PostGIS 2.x installé en tant qu'extension

source: If these requirements are met, then open a terminal window and execute the following commands (or run these commands in pgAdmin 3:
fr: Si vous rencontrez ces exigences, ouvrez un terminal et exécuter les commandes suivantes (ou lancez ces commandes dans pgAdmin 3:

source: If you're looking for the SQL files containing pgRouting function, you can find them in ``/usr/share/postgresql/9.1/contrib/pgrouting-2.0/``:
fr: Si vous cherchez des fichiers SQL contenants des fonctions pgRouting, vous pouvez en trouver dans ``/usr/share/postgresql/9.1/contrib/pgrouting-2.0/``:

source: Data
fr: Données

source: The pgRouting workshop will make use of OpenStreetMap data, which is already available on the LiveDVD. If you don't use the LiveDVD or want to download the latest data or the data of your choice, you can make use of OpenStreetMap's API from your terminal window:
fr: L'atelier pgRouting, qui vous permet d'utiliser les données d'OpenStreetMap, est déjà disponible sur le LiveDVD. Si vous ne voulez pas utiliser le LiveDVD ou si vous voulez télécharger les dernières données ou utiliser celles de votre choix, vous pouvez utiliser l'API d'OpenStreetMap depuis le terminal:

source: More information how to get OSM data:
fr: Plus d'information sur comment obtenir des données OSM

source: OpenStreetMap download information in http://wiki.openstreetmap.org/wiki/Downloading_data
fr: Information de téléchargement d'OpenStreetMap sur http://wiki.openstreetmap.org/wiki/Downloading_data

source: OpenStreetMap data is available at the LiveDVD in ``/usr/local/share/osm/``
fr: Les données d'OpenStreetMap sont disponibles sur le LiveDVD dans ``/usr/local/share/osm/``

source: An alternative for very large areas is the download services of `Geofabrik <http://download.geofabrik.de>`_. Download a country extract and unpack the data like this:
fr: Une alternative pour les zones très large sont les services de téléchargement de `Geofabrik <http://download.geofabrik.de>`_. Télécharger une extraction d'un pays et décompresser les données comme ceci:

source: Data of a whole country might be too big for the LiveDVD as well as processing time might take very long.
fr: Les données pour un pays entier peuvent être trop importantes pour le LiveDVD, ce qui induit un temps de traitement vraiment très long.
